jQuery.extend(jQuery.validator.messages, {
    required: "Αυτό το πεδίο είναι υποχρεωτικό. ",
    remote: "Παρακαλώ επιδιορθώστε αυτό το πεδίο. ",
    email: "Παρακαλώ εισάγετε ένα έγκυρο email. ",
    url: "Παρακαλώ εισάγετε ένα έγκυρο σύνδεσμό. ",
    date: "Παρακαλώ εισάγετε μια έγκυρη ημερομηνία. ",
    dateISO: "Παρακαλώ εισάγετε μια έγκυρη ημερομηνία (ISO). ",
    number: "Παρακαλώ εισάγετε έναν έγκυρο αριθμό. ",
    digits: "Παρακαλώ εισάγετε μόνο ψηφία. ",
    creditcard: "Παρακαλώ εισάγετε έναν έγκυρο αριθμό πιστωτικής κάρτας. ",
    equalTo: "Παρακαλώ εισάγετε τα ίδια στοιχεία ξανά. ",
    accept: "Παρακαλώ εισάγετε μια τιμή με μία έγκυρη επέκταση. ",
    maxlength: jQuery.validator.format("Παρακαλώ εισάγετε έως {0} χαρακτήρες. "),
    minlength: jQuery.validator.format("Παρακαλώ εισάγετε τουλάχιστον {0} χαρακτήρες. "),
    rangelength: jQuery.validator.format("Παρακαλώ εισάγετε μια τιμή μήκους από {0} έως {1} χαρακτήρες. "),
    range: jQuery.validator.format("Παρακαλώ εισάγετε μια τιμή μεταξύ του {0} και του {1}. "),
    max: jQuery.validator.format("Παρακαλώ εισάγετε μια τιμή μικρότερη ή ίση του {0}. "),
    min: jQuery.validator.format("Παρακαλώ εισάγετε μια τιμή μεγαλύτερη ή ίση του {0}. ")
});