<?php
/**
 * Language file for auth error messages
 *
 */

return array(

    'account_already_exists' => 'Υπάρχει ήδη ένας λογαριασμός με το ίδιο email.',
    'account_not_found'      => 'Το όνομα χρήστη ή ο κωδικός είναι λάθος.',
    'account_not_activated'  => 'Αυτός ο λογαριασμός χρήσης δεν είναι ενεργοποιημένος.',
    'account_suspended'      => 'Ο λογαριασμός αυτός αδρανοποιήθηκε λόγω πολλαπλών προσπαθειών εισόδου. Παρακαλώ δοκιμάστε έπειτα από  [:delay] δευτερόλεπτα',
    'account_banned'         => 'Αυτός ο λογαριασμός έχει αποκλειστεί.',

    'signin' => array(
        'error'   => 'Υπήρξε ένα πρόβλημα με την είσοδο σας στο σύστημα. Παρακαλώ δοκιμάστε ξανά.',
        'success' => 'Έχετε εισέλθει με επιτυχία στο σύστημα.',
    ),

    'signup' => array(
        'error'   => 'Υπήρξε ένα πρόβλημα με την δημιουργία λογαριασμού στο σύστημα. Παρακαλώ δοκιμάστε ξανά.',
        'success' => 'Ο λογαριασμός σας δημιουργήθηκε με επιτυχία στο σύστημα.',
    ),

    'forgot-password' => array(
        'error'   => 'Υπήρξε ένα πρόβλημα με την ανάκτηση του κωδικού σας στο σύστημα. Παρακαλώ δοκιμάστε ξανά.',
        'success' => 'Ο κωδικός σας εστάλη με επιτυχία στο σύστημα.',
    ),

    'forgot-password-confirm' => array(
        'error'   => 'Υπήρξε ένα πρόβλημα με την αναίρεση του κωδικού σας στο σύστημα. Παρακαλώ δοκιμάστε ξανά.',
        'success' => 'Η αναίρεση του κωδικού σας ήταν επιτυχής.',
    ),

    'activate' => array(
        'error'   => 'Υπήρξε ένα πρόβλημα με την ενεργοποίηση του λογαριασμού σας στο σύστημα. Παρακαλώ δοκιμάστε ξανά.',
        'success' => 'Ο λογαριασμός σας ενεργοποιήθηκε με επιτυχία.',
    ),

);
